Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་ཞེས་བྱ་བ་དེ་ནི། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ལ་ཞུགས་པའོ། །དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་བསམ་པ་རྟོགས་པར་ཁོང་དུ་ཆུད་པའོ། །དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པའི་རྗེས་སུ་ཞུགས་པའོ། །དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བ་ལ་མངོན་དུ་གྱུར་པའོ། །དེ་ནི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱས་པའོ། །དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་ལ་རབ་ཏུ་གནས་པའོ། །དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ས་ཐམས་ཅད་ལ་རབ་ཏུ་གནས་པའོ། །དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ཐམས་ཅད་རབ་ཏུ་ཐོབ་པའོ། །དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་པའོ། །དེ་ནི་ལུང་བསྟན་པ་ཐམས་ཅད་ཡང་དག་པར་བླང་བའོ། དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་ཐམས་ཅད་ལ་རྣམ་པར་རྩེ་བའོ། །དེ་ནི་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཐམས་ཅད་ཡོངས་སུ་བླང་བའོ། །དེ་ནི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་ཡུལ་ལ་དབང་བསྐུར་བས་མངོན་པར་དབང་བསྐུར་བའོ། །རིགས་ཀྱི་བུ་དགེ་བའི་བཤེས་གཉེན་དེ་ཁྱོད་ལ་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱིས་ནི་མངོན་པར་བརླན་པར་བྱེད་དོ། །བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ནི་རྣམ་པར་འཕེལ་བར་བྱེད་དོ། །ལྷག་པའི་བསམ་པའི་དབྱིངས་ནི་རབ་ཏུ་བརྟན་པར་བྱེད་དོ། །
en: Noble one, the bodhisattva Maitreya has understood all bodhisattva conduct, he has comprehended the minds and thoughts of all beings, he has followed the conduct of all beings, he is focused on ripening and guiding all beings, he has completed all the perfections, he dwells on all the bodhisattva bhūmis, he has attained all the patience of a bodhisattva, he is free of the defects of a bodhisattva, he possesses all the prophecies of a bodhisattva, he delights in all the liberations of a bodhisattva, he has acquired all the blessings of the buddhas, and he has been empowered by the empowerment of the range of omniscience of all the tathāgatas.

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་ནི་ཤིན་ཏུ་བྱང་བར་བྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའི་དབང་པོའི་ཤུགས་ནི་ཡང་དག་པར་འཕེལ་བར་བྱེད་དོ། །ཆོས་ཀྱི་ཕྱོགས་བསྒྲིབས་པ་མེད་པ་ནི་ཡོངས་སུ་སྟོན་པར་བྱེད་དོ། །གཞི་ཀུན་ཏུ་ཟུག་པའི་ས་ཁོང་དུ་ཆུད་པར་བྱ་བ་ནི་རྟོགས་པར་བྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་གྱི་སར་འབྱུང་བའི་སྒོ་ལ་ནི་གཞོག་པར་བྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་དང་། སྨོན་ལམ་གྱི་ཡོན་ཏན་ཡོངས་སུ་གྲུབ་པ་ནི་ཡང་དག་པར་རྫོགས་པར་འགྱུར་རོ། །
en: “Noble one, that kalyāṇamitra will saturate you with roots of merit, he will increase your aspiration for enlightenment, he will make the element of your superior aspiration stable, he will purify all your roots of merit, he will increase the force of your bodhisattva powers, he will reveal the unobscured direction of the Dharma, he will make you realize the understanding of all the bhūmis that are entered, he will make you enter the gateways to the arising of the prayers of all bodhisattvas, and he will show you the gateway to the arising of the attainment of the completely good bodhisattva conduct.

source: བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ཐོབ་པར་བྱ་བའི་སྐྱེ་བའི་སྒོ་ནི་ཡོངས་སུ་སྟོན་པར་འགྱུར་གྱིས། རིགས་ཀྱི་བུ་ཁྱོད་དགེ་བའི་རྩ་བ་གཅིག་ལ་ཆགས་པར་མ་བྱེད་ཅིག །
en: “Noble one, do not be attached to one root of merit!

source: ཆོས་ཀྱི་སྒོའི་འོད་སྣང་བ་གཅིག་ལ་གཞོལ་བར་མ་བྱེད་ཅིག །སྤྱོད་པ་གཅིག་ཡོངས་སུ་རྫོགས་པས་ཆོག་པར་མ་སེམས་ཤིག །
en: Do not be devoted to one illumination from the light of a Dharma gateway!

source: སྨོན་ལམ་གཅིག་པུ་མངོན་པར་བསྒྲུབ་པ་ལྷུར་མ་ལེན་ཅིག །
en: Do not be dedicated to accomplishing one prayer!

source: ལུང་བསྟན་པ་གཅིག་གིས་མཐར་ཐུག་པས་རྒྱུན་གཅད་པར་མ་བྱེད་ཅིག །
en: Do not continuously follow through one prophecy!

source: བཟོད་པ་གསུམ་ལ་འཇུག་པས་ཆོག་པར་བྱ་བའི་འདུ་ཤེས་སུ་མ་བྱེད་ཅིག །
en: Do not have the perception that three kinds of patience are enough!

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་རྒྱུན་མ་གཅོད་ཅིག །
en: Do not continually bring to completion six perfections!

source: ས་བཅུ་ཐོབ་པས་མཐར་ཐུག་པར་མ་བྱེད་ཅིག །
en: Do not make attaining ten bhūmis the ultimate goal!

source: སངས་རྒྱས་ཀྱི་ཞིང་ཚད་ཡོད་པ་ཡོངས་སུ་གཟུང་བ་དང་། ཡོངས་སུ་དག་པར་བྱ་བ་མ་སྨོན་ཅིག །
en: Do not aspire to possess and purify a measurable number of buddha realms!

source: དགེ་བའི་བཤེས་གཉེན་ཚད་ཡོད་པ་དགའ་བར་བྱ་བ་དང་། བསྙེན་བཀུར་བས་ངོམས་པར་མ་བྱེད་ཅིག །
en: Do not be satisfied by rejoicing in and serving a measurable extent of kalyāṇamitras!

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔས་ནི་དགེ་བའི་རྩ་བ་ཚད་མེད་པ་ཡོངས་སུ་བསྡུ་བར་བྱ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཚད་མེད་པ་ཤིན་ཏུ་བསྒྲུབ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱི་རྒྱུ་ཚད་མེད་པ་ཡོངས་སུ་བསྩགས་དགོས་སོ། །ཡོངས་སུ་བསྔོ་བའི་ཚུལ་ཚད་མེད་པ་ལ་བསླབ་པར་བྱ་དགོས་སོ། །སེམས་ཅན་གྱི་ཁམས་ཚད་མེད་པ་ཡོངས་སུ་སྨིན་པར་བྱ་དགོས་སོ། །སེམས་ཅན་གྱི་བསམ་པའི་ཁམས་ཚད་མེད་པ་ལ་འཇུག་པར་བྱ་དགོས་སོ། །སེམས་ཅན་གྱི་དབང་པོ་ཚད་མེད་པ་ཡོངས་སུ་ཤེས་པར་བྱ་དགོས་སོ། །སེམས་ཅན་གྱི་མོས་པ་ཚད་མེད་པའི་རྗེས་སུ་འབྲང་བར་བྱ་དགོས་སོ། །སེམས་ཅན་གྱི་སྤྱོད་པ་ཚད་མྱེད་པ་ཁོང་དུ་ཆུད་པར་བྱ་དགོས་སོ། །སེམས་ཅན་ཚད་མེད་པ་གདུལ་བར་བྱ་དགོས་སོ། །ཉོན་མོངས་པ་དང་བག་ལ་ཉལ་བ་ཚད་མེད་པ་ཡང་དག་པར་གཞོམ་དགོས་སོ། །ལས་ཀྱི་སྒྲིབ་པ་ཚད་མེད་པ་ཡོངས་སུ་སྦྱང་དགོས་སོ། །ལྟ་བའི་རྣམ་པ་ཚད་མེད་པ་རྣམ་པར་བཟློག་དགོས་སོ། །སེམས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པ་ཚད་མེད་པ་བསྩལ་བར་བྱ་དགོས་སོ། །སེམས་རྣམ་པར་དག་པ་ཚད་མེད་པ་བསྐྱེད་པར་བྱ་དགོས་སོ། །སྡུག་བསྔལ་གྱི་ཟུག་རྔུ་ཚད་མེད་པ་ཡང་དག་པར་དབྱུང་དགོས་སོ། །སྲིད་པའི་རྒྱ་མཚོ་ཚད་མེད་པ་ཡོངས་སུ་བསྐམ་པར་བྱ་དགོས་སོ། །མ་རིག་པའི་མུན་པ་ཚད་མེད་པ་རྣམ་པར་བསལ་དགོས་སོ། །ང་རྒྱལ་གྱི་རི་ཚད་མེད་པ་རབ་ཏུ་བསྙིལ་དགོས་སོ། །འཁོར་བའི་བཅིངས་པ་ཚད་མེད་པ་ཤིན་ཏུ་གཏུབ་དགོས་སོ། །སྲིད་པའི་ཆུ་བོ་ཚད་མེད་པ་བརྒལ་དགོས་སོ། །ཚེའི་རྒྱ་མཚོ་ཚད་མེད་པ་བསྐམ་དགོས་སོ། །སེམས་ཅན་འདོད་པའི་འདམ་དུ་ཐོགས་པ་ཚད་མེད་པ་ཡོངས་སུ་དགྲོལ་དགོས་སོ། །སེམས་ཅན་ཁམས་གསུམ་གྱི་ཁྱིམ་དུ་ཐོགས་པ་ཚད་མེད་པ་གདོན་པར་བྱ་དགོས་སོ། །སེམས་ཅན་ཚད་མེད་པ་འཕགས་པའི་ལམ་ལ་དགོད་དགོས་སོ། །
en: “Why is that?

source: འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་གི་སྤྱོད་པ་ཚད་མེད་པ་རབ་ཏུ་ཞི་བར་བྱ་དགོས་སོ། །བདུད་ཀྱི་ཞགས་པ་ཚད་མེད་པ་ལས་ཡང་དག་པར་འདའ་བར་བྱ་དགོས་སོ། །བདུད་ཀྱི་ལས་ཚད་མེད་པ་རྣམ་པར་བཟློག་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་བསམ་པའི་ཁམས་ཚད་མྱེད་པ་ཡོངས་སུ་སྦྱང་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་སྦྱོར་བ་ཚད་མེད་པ་རྣམ་པར་འཕེལ་བར་བྱ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་ཚད་མེད་པ་ཡོངས་སུ་བསྐྱེད་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་མོས་པ་ཚད་མེད་པ་ཡོངས་སུ་སྦྱང་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་མཉམ་པ་ཉིད་ཚད་མེད་པ་ལ་འཇུག་པར་བྱ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཁྱད་པར་ཚད་མེད་པའི་རྗེས་སུ་འབྲང་བར་བྱ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཚད་མེད་པ་ཡོངས་སུ་དག་པར་བྱ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔས་བྱ་བའི་སྤྱོད་པ་ཚད་མེད་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་དགོས་སོ། །འཇིག་རྟེན་གྱི་སྤྱོད་པ་ཚད་མེད་པའི་རྗེས་སུ་འབྲང་བར་བྱ་དགོས་སོ། །འཇིག་རྟེན་གྱི་རྗེས་སུ་འབྲང་བ་ཚད་མེད་པ་ཡོངས་སུ་བསྟན་དགོས་སོ། །དད་པའི་སྟོབས་ཚད་མེད་པ་ཡོངས་སུ་བསྐྱེད་དགོས་སོ། །བརྩོན་འགྲུས་ཀྱི་སྟོབས་ཚད་མེད་པ་ཉེ་བར་བརྟན་དགོས་སོ། །དྲན་པའི་སྟོབས་ཚད་མེད་པ་ཡོངས་སུ་དག་པར་བྱ་དགོས་སོ། །ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཚད་མེད་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་དགོས་སོ། །ཤེས་རབ་ཀྱི་སྟོབས་ཚད་མེད་པ་བསྐྱེད་པར་བྱ་དགོས་སོ། །མོས་པའི་སྟོབས་ཚད་མེད་པ་བརྟན་པར་བྱ་དགོས་སོ། །བསོད་ནམས་ཀྱི་སྟོབས་ཚད་མེད་པ་ཡང་དག་པར་བསྒྲུབ་དགོས་སོ། །ཡེ་ཤེས་ཀྱི་སྟོབས་ཚད་མེད་པ་རྣམ་པར་སྤེལ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་ཚད་མེད་པ་ཡང་དག་པར་བསྒྲུབ་དགོས་སོ། །སངས་རྒྱས་ཀྱི་སྟོབས་ཚད་མེད་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་དགོས་སོ། །ཆོས་ཀྱི་སྒོ་ཚད་མེད་པ་རབ་ཏུ་དབྱེ་དགོས་སོ། །ཆོས་ཀྱི་ཕྱོགས་ཚད་མེད་པ་ལ་འཇུག་པར་བྱ་དགོས་སོ། །ཆོས་ཀྱི་སྒོ་ཚད་མེད་པ་ཡོངས་སུ་སྦྱང་དགོས་སོ། །ཆོས་ཀྱི་སྣང་བ་ཚད་མེད་པ་ཡང་དག་པར་བསྐྱེད་དགོས་སོ། །ཆོས་ཀྱི་གསལ་བ་ཚད་མེད་པར་རབ་ཏུ་བྱ་དགོས་སོ། །དབང་པོའི་རྒྱུད་ཚད་མེད་པ་སྣང་བར་བྱ་དགོས་སོ། །ཉོན་མོངས་པའི་ནད་ཚད་མེད་པ་ཡོངས་སུ་ཤེས་པར་བྱ་དགོས་སོ། །ཆོས་ཀྱི་སྨན་ཚད་མེད་པ་ཡང་དག་པར་བསྡུ་དགོས་སོ། །ཉོན་མོངས་པའི་ནད་ཀྱིས་བཏབ་པའི་སེམས་ཅན་གྱི་ཁམས་ཚད་མེད་པ་གསོ་དགོས་སོ། །བདུད་རྩིའི་ཚོགས་ཚད་མེད་པ་ཡང་དག་པར་བསྡུ་བར་བྱ་དགོས་སོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཚད་མེད་པ་འདའ་བར་བྱ་དགོས་སོ། །དེ་བཞིན་གཤེགས་པ་ཚད་མེད་པ་མཆོད་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཚད་མེད་པར་འཇུག་པར་བྱ་དགོས་སོ། །དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ཚད་མེད་པ་ཡོངས་སུ་གཟུང་དགོས་སོ། །སེམས་ཅན་གྱི་གནོད་པ་ཚད་མེད་པ་བཟོད་པར་བྱ་དགོས་སོ། །མི་ཁོམ་པ་དང་ངན་སོང་གི་ལམ་ཚད་མེད་པ་ཡོངས་སུ་གཅད་དགོས་སོ། །སེམས་ཅན་གྱི་བདེ་བ་ཚད་མེད་པ་ཉེ་བར་བསྒྲུབ་དགོས་སོ། །སེམས་ཅན་བསྡུ་བ་ཚད་མེད་པ་བྱ་དགོས་སོ། །གཟུངས་ཀྱི་སྒོ་ཚད་མེད་པ་ཡོངས་སུ་སྦྱང་དགོས་སོ། །སྨོན་ལམ་གྱི་སྒོ་ཚད་མེད་པ་མངོན་པར་བསྒྲུབ་དགོས་སོ། །བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་ཚད་མེད་པ་ཡོངས་སུ་བསྒོམ་དགོས་སོ། །ཆོས་ཡོངས་སུ་བཙལ་བ་ལ་བརྩོན་པར་བྱ་བ་ཚད་མེད་པ་རྒྱུན་མི་གཅད་པར་བྱ་དགོས་སོ། །ངེས་པར་རྟོགས་པའི་སྟོབས་ཚད་མྱེད་པའི་རྗེས་སུ་འཇུག་དགོས་སོ། །མངོན་པར་ཤེས་པ་མངོན་དུ་བསྒྲུབ་པ་ཚད་མེད་པ་བསྐྱེད་དགོས་སོ། །རིག་པ་དང་ཡེ་ཤེས་ཀྱི་སྣང་བ་ཚད་མེད་པ་རྣམ་པར་དག་པར་བྱ་དགོས་སོ། །སེམས་ཅན་གྱི་རྒྱུད་ཚད་མེད་པའི་རྗེས་སུ་འགྲོ་བར་བྱ་དགོས་སོ། །སྲིད་པར་སྐྱེ་བ་ཚད་མེད་པ་ཡོངས་སུ་གཟུང་དགོས་སོ། །ལུས་རྣམ་པར་ཕྱེ་བ་ཚད་མེད་པ་ཡོངས་སུ་བསྟན་དགོས་སོ། །སྐད་རྣམ་པར་ཕྱེ་བ་ཚད་མེད་པ་ཡོངས་སུ་ཤེས་པར་བྱ་དགོས་སོ། །སེམས་ཅན་གྱི་སེམས་རྣམ་པ་ཐ་དད་པ་ཚད་མེད་པ་ཁོང་དུ་ཆུད་པར་བྱ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ཡུལ་རྒྱ་ཆེན་པོའི་རྗེས་སུ་འཇུག་པར་བྱ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་གནས་ཤིན་ཏུ་ཡངས་པར་རྗེས་སུ་སྤྱད་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་སྤྱོད་པ་ཟབ་མོ་ལ་རྣམ་པར་བལྟ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་ཡུལ་རྟོགས་པར་དཀའ་བ་ཁོང་དུ་ཆུད་པར་བྱ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་ལམ་བགྲོད་པར་དཀའ་བ་བགྲོད་པར་བྱ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་ཤུགས་བསྒྲུབ་པར་དཀའ་བ་ཡོངས་སུ་གཟུང་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པ་འཇུག་པར་དཀའ་བ་ལ་འཇུག་པར་བྱ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམ་པ་སྣ་ཚོགས་ཁོང་དུ་ཆུད་པར་བྱ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་དུ་ཁྱབ་པ་ཀུན་ཏུ་བསྟན་དགོས་སོ། །
en: Noble one, a bodhisattva must gather countless roots of merit; must accomplish countless bodhisattva accumulations; must gather countless causes of bodhisattva motivation; must train in countless ways of dedication; must ripen countless realms of beings; must comprehend countless elements of thought in beings; must know countless faculties of beings; must follow countless aspirations of beings; must comprehend countless conducts of beings; must guide countless beings; must overcome countless kleśas and predispositions; must purify countless obscurations from karma; must dispel countless wrong views; must eliminate countless kleśas from the mind; must generate countless purifications of the mind; must banish countless agonies from suffering; must dry up countless oceans of existences; must dispel countless darknesses from ignorance; must demolish countless mountains of pride; must cut through countless bondages of saṃsāra; must cross over countless rivers of existences; must dry up countless oceans of rebirths; must free countless beings stuck in the swamp of desire; must bring out countless beings trapped in the mansion of the three realms; must bring countless beings onto the path of the āryas; must bring to an end countless conducts of desire, anger, and ignorance; must pass beyond countless māra nooses; must repel countless māra activities; must purify countless elements of the superior motivation of a bodhisattva; must increase countless bodhisattva conducts; must generate countless bodhisattva powers; must purify countless bodhisattva aspirations; must enter countless bodhisattva equanimities; must follow countless particular qualities of bodhisattva conduct; must purify countless bodhisattva qualities; must complete countless bodhisattva conducts; must conform with countless worldly conducts; must manifest countless conformities with the world; must generate countless strengths of faith; must make firm countless strengths of diligence; must purify countless strengths of memory; must perfect countless strengths of samādhi; must generate countless strengths of wisdom; must make firm countless strengths of aspiration; must accomplish countless strengths of merit; must increase countless strengths of knowledge; must accomplish countless bodhisattva strengths; must perfect countless buddha strengths; must open countless Dharma doors; must enter countless Dharma directions; must generate countless Dharma lights; must create countless Dharma illuminations; must illuminate countless classes of powers; must know countless kleśa illnesses; must gather countless Dharma medicines; must heal countless elements of beings afflicted by kleśa illnesses; must gather countless accumulations of amrita; must reach countless buddha realms; must make offerings to countless tathāgatas; must enter countless bodhisattva assemblies of followers; must obtain countless teachings from tathāgatas; must have patience for countless harms from beings; must eliminate countless unfortunate existences and lower existences; must accomplish countless happinesses for beings; must accomplish countless gatherings of beings; must purify countless gateways to the power of retention; must accomplish countless gateways to prayer; must meditate on countless strengths of great love and great compassion; must have continuous, countless dedications to searching for the Dharma; must gain countless strengths of certainty; must generate countless accomplishments of higher cognitions; must purify countless lights of insight and knowledge; must be in conformity with countless classes of beings; must take countless births in existences; must manifest countless categories of bodies; must know countless categories of languages; must comprehend countless different kinds of minds of beings; must enter into the vast bodhisattva range of activity; must perform conduct in the extensive bodhisattva locations; must look at profound bodhisattva conduct; must comprehend the bodhisattva scope of perception that is difficult to understand; must follow on the bodhisattva path that is difficult to follow; must gain the bodhisattva power that is difficult to accomplish; must gain bodhisattva faultlessness that is difficult to gain; must comprehend the variety of bodhisattva conducts; and must manifest all-pervading bodhisattva miraculous manifestations.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་སྤྲིན་ཡོངས་སུ་གཟུང་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་དྲ་བ་མཐའ་དང་དབུས་མེད་པར་རབ་ཏུ་རྒྱས་པར་བྱ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔས་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔས་ལུང་བསྟན་པ་ཚད་མེད་པར་ཡང་དག་པར་མནོད་དགོས་སོ། །
en: A bodhisattva must obtain the clouds of the Dharma and must expand the vast extent, without end or middle, of bodhisattva conduct.

source: བྱང་ཆུབ་སེམས་དཔས་བཟོད་པའི་སྒོ་དཔག་ཏུ་མེད་པ་ལ་འཇུག་པར་བྱ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔས་གྲགས་མྱེད་པ་ཡོངས་སུ་སྦྱང་བར་བྱ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔས་ཆོས་ཀྱི་སྒོ་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་དག་པར་བྱ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པ་ཡོངས་སུ་སྦྱང་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔས་བསྐལ་པ་མཐའ་ཡས་པར་གོ་ཆ་བགོ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔས་དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་པ་མཆོད་པར་བྱ་དགོས་སོ། །བྱང་ཆུབ་སེམས་དཔས་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་བསམ་གྱིས་མི་ཁྱབ་པར་མངོན་པར་བསྒྲུབ་དགོས་སོ། །རིགས་ཀྱི་བུ་མདོར་ན་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་ནི་སེམས་ཅན་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ། །
en: A bodhisattva must complete all the perfections; a bodhisattva must acquire countless prophecies; a bodhisattva must enter an incalculable number of gateways into patience; a bodhisattva must purify innumerable bhūmis; a bodhisattva must make pure a countless number of gateways to the Dharma; a bodhisattva must purify an indescribable number of buddha realms; a bodhisattva must put on the armor for remaining throughout endless kalpas; a bodhisattva must make offerings to countless tathāgatas; and a bodhisattva must accomplish an inconceivable number of accomplished prayers.

source: བསྐལ་པ་ཐམས་ཅད་དུ་གནས་པས་བསྐལ་པ་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ། །ཐམས་ཅད་དུ་སྐྱེ་བ་ཡོངས་སུ་སྟོན་པས་སྐྱེ་བ་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ། །དུས་གསུམ་གྱི་ཡེ་ཤེས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཕྱིར་དུས་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ། །ཆོས་ཐམས་ཅད་ལ་ནན་ཏན་དུ་བྱེད་པས་ཆོས་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ། །ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱེད་པས་ཞིང་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ། །སྨོན་ལམ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པས། སྨོན་ལམ་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ། །སངས་རྒྱས་ཐམས་ཅད་མཆོད་པ་མངོན་པར་བསྒྲུབ་པས། སངས་རྒྱས་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་དང་གཅིག་ཏུ་འགྱུར་བའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ། །དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་ལ་བསྙེན་བཀུར་བྱེད་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་ནི་དགེ་བའི་བཤེས་གཉེན་ཐམས་ཅད་དང་མཉམ་པར་བསྟན་ཏོ། །
en: “Noble one, in brief, bodhisattva conduct manifests equally to all beings because it ripens all beings; it manifests equally in all kalpas because it remains throughout all kalpas; it manifests equally in all births because it manifests births everywhere; it manifests equally in all times because of the realization of the knowledge of the three times; it manifests equally in all Dharmas because it is the practice of all Dharmas; it manifests equally in all realms because it purifies all realms; it manifests equally in all prayers because it fulfills all prayers; it manifests equally to all buddhas because it is the accomplishment of making offerings to all buddhas; it manifests equally in all bodhisattvas because it is the one prayer of all bodhisattvas; and it manifests equally to all kalyāṇamitras because it serves all kalyāṇamitras.

source: རིགས་ཀྱི་བུ་དེ་བས་ན་ཁྱོད་ཀྱིས་དགེ་བའི་བཤེས་གཉེན་ཡོངས་སུ་བཙལ་བ་ལ་སྐྱོ་བར་མི་བྱའོ། །
en: “Therefore, noble one, never weary of seeking for kalyāṇamitras!

source: དགེ་བའི་བཤེས་གཉེན་མཐོང་བས་ངོམས་པ་བསྐྱེད་པར་མི་བྱའོ། །
en: Never feel you have had enough of seeing kalyāṇamitras!

source: དགེ་བའི་བཤེས་གཉེན་ལ་ཡོངས་སུ་དྲི་བས་ཆོག་ཤེས་པར་མི་བྱའོ། །
en: Never feel you no longer need to ask questions of kalyāṇamitras!

source: དགེ་བའི་བཤེས་གཉེན་དང་འགྲོགས་པ་ལས་བསམ་པ་ཕྱིར་ལྡོག་པར་མི་བྱའོ། །དགེ་བའི་བཤེས་གཉེན་ལ་ཕུ་དུད་དང་།
en: Never turn your thoughts away from being with kalyāṇamitras!

source: རིམ་གྲོའི་སྦྱོར་བ་རྒྱུན་གཅད་པར་མི་བྱའོ། །
en: Never cease from revering and venerating kalyāṇamitras!

source: དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་དང་། རྗེས་སུ་བསྟན་པ་ལ་ལོག་པར་གཟུང་བར་མི་བྱའོ། །
en: Never maintain the instructions and teachings of the kalyāṇamitras incorrectly!

source: དགེ་བའི་བཤེས་གཉེན་གྱི་ཡོན་ཏན་ཐོབ་པར་འགྱུར་བ་ལ་ཐེ་ཚོམ་མི་བསྐྱེད་དོ། །
en: Never have doubts concerning the attainment of the qualities of the kalyāṇamitras!

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་འབྱུང་བའི་སྒོ་བསྟན་པ་ལ་ཡིད་གཉིས་སུ་མི་བྱའོ། །
en: Never have uncertainty concerning the teaching of gateways that have been brought forth by the kalyāṇamitras!

source: དགེ་བའི་བཤེས་གཉེན་གྱི་ཐབས་ཀྱི་བསམ་པ་དང་། འཇིག་རྟེན་གྱི་རྗེས་སུ་འབྲང་བར་བྱ་བའི་རྒྱུད་ལ་ཞེ་སྡང་བསྐྱེད་པར་མི་བྱའོ། །
en: Never have anger toward the following of worldly ways through the use of methods by kalyāṇamitras!

source: དགེ་བའི་བཤེས་གཉེན་ལ་མོས་པ་རྣམ་པར་བསྐྱེད་པས་ལུས་དང་སེམས་རྣམ་པར་ལྡོག་པར་མི་བྱའོ། །
en: Never let your mind and body deviate from the development of adoration for the kalyāṇamitras!

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ཐོས་པ་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་རག་ལས་པའོ། །
en: Noble one, hearing of all the bodhisattva conducts of bodhisattvas is dependent on the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་བའོ། །
en: All the completion of the qualities of a bodhisattva comes from the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་རྒྱུན་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་བའོ། །
en: All the continuation of bodhisattva prayers comes from the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྐྱེད་པའོ། །
en: All the roots of merit of a bodhisattva are created by the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྒྲུབས་པའོ། །
en: All the accumulations of a bodhisattva are accomplished by the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་སྒོ་སྣང་བ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་བའོ། །
en: All the lights from the Dharma doors of the bodhisattvas come from the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་འབྱུང་བའི་སྒོ་རྣམ་པར་དག་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལས་བྱུང་བའོ། །
en: All the pure doors of the setting-forth of bodhisattvas come from the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ལ་ནན་ཏན་དུ་བྱ་བ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་རག་ལས་པའོ། །
en: All the practices of bodhisattva training are dependent on the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་གྱི་ཆོས་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་གནས་པའོ། །
en: All the phenomena of the qualities of bodhisattvas rely on the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་བསམ་པ་ཡོངས་སུ་དག་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་རྩ་བར་གྱུར་པའོ། །
en: All the pure higher motivations of bodhisattvas have the kalyāṇamitras as their roots.

source: བྱང་ཆུབ་སེམས་དཔའི་སེམས་བསྐྱེད་པ་བརྟན་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལས་སྐྱེས་པའོ། །
en: All the firm developments of the aspiration to enlightenment of the bodhisattvas arise from the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་གཟུངས་དང་སྤོབས་པའི་སྒོ་སྣང་བ་ཐམས་ཅད་དུ་ཁྲིད་པ་ནི་དགེ་བའི་བཤེས་གཉེན་ནོ། །
en: The kalyāṇamitras are the guides to all the light from the doors to the mental retention and eloquence of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་དག་པའི་སྒོའི་མཛོད་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བའོ། །
en: The kalyāṇamitras possess all the treasures of the doors to the purity of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་སྣང་བ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡང་དག་པར་བསྐྱེད་པའོ། །
en: The kalyāṇamitras give rise to all the light of the knowledge of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ཁྱད་པར་ཅན་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་ལག་ན་འདུག་པའོ། །
en: The kalyāṇamitras hold in their hands all the special prayers of the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་གྱི་ཚུལ་གྱི་རྒྱུད་གཅིག་ཏུ་གྱུར་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་བརྟེན་པའོ། །
en: The single family of the way of the prayers of bodhisattvas is dependent on the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡང་དག་པར་བསྒྲུབ་པ་ཁྱད་པར་ཅན་མཉམ་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་རྒྱུད་ལས་བྱུང་བའོ། །
en: The equality of all the special accomplishments of the bodhisattvas comes from the family of the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་གསང་བའི་གནས་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་མཛོད་ན་འདུག་པའོ། །
en: All the secret states of the bodhisattvas are in the treasury of the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་འབྱུང་གནས་ནས་བྱུང་བའོ། །
en: All the qualities of the bodhisattvas originate in the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་དབང་པོའི་ཤུགས་ཀྱི་མྱུ་གུ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་རྣམ་པར་སྤེལ་བའོ། །
en: All the seedlings of the force of the power of bodhisattvas are increased by the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་རྒྱ་མཚོ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡང་དག་པར་སྤེལ་བའོ། །
en: All the oceans of wisdom of the bodhisattvas are increased by the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་གཏེར་གྱི་མཛོད་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བསྐྱངས་པའོ། །
en: All the treasuries of the wealth of the bodhisattvas are protected by the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་བསྩགས་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྲུངས་པའོ། །
en: All the accumulations of merit of the bodhisattvas are guarded by the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་ཚེ་རྣམ་པར་དག་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྐྱེད་པའོ། །
en: All the pure lifetimes of the bodhisattvas are created by the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་མཉན་པའི་སྤྲིན་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་ཁ་ནས་བྱུང་བའོ། །
en: All the clouds of Dharma heard by the bodhisattvas come from the mouths of the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའ་འབྱུང་བའི་ལམ་ལ་འཇུག་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱི་ཁོང་ན་ཡོད་པའོ། །
en: All the paths of setting forth entered by the bodhisattvas are within the kalyāṇamitras.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་ནི་དགེ་བའི་བཤེས་གཉེན་ལ་རིམ་གྲོ་བྱས་པས་ཐོབ་པའོ། །
en: All the enlightenments of the buddhas are attained through venerating the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བའོ། །
en: All the conducts of the bodhisattvas are possessed by the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་ཡོན་ཏན་བརྗོད་པ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་བསྟན་པའོ། །
en: All the descriptions of the qualities of bodhisattvas are taught by the kalyāṇamitras.

source: བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་ཕྱོགས་ཀྱི་རྗེས་སུ་འབྲང་བ་ཐམས་ཅད་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བསྟན་པའོ། །
en: All following the direction of the Dharma by bodhisattvas is taught by the kalyāṇamitras.
